{"you":0,"may":1,"find":2,"information":3,"about":4,"contributing":5,"vllm":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"11":193,"seventh":194,"h0qvrajz":195,"snowflake":196,"1e3cxqbv3jsfgp30swyvs3em_tw":197,"ghohj9pajgk6kr54":198,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":199,"10":200,"have":201,"just":202,"created":203,"coordinating":204,"contributions":205,"discussing":206,"features":207,"feel":208,"free":209,"join":210,"us":211,"ray":212,"summit":213,"held":214,"special":215,"track":216,"opening":217,"talk":218,"1b_kqxphbtra_mdf":219,"tr6i8rwdou5qotznceg2mkzxehm":220,"learn":221,"talks":222,"youtube":223,"playlist":224,"list":225,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":226,"other":227,"contributors":228,"users":229,"09":230,"sixth":231,"87q3nvnh":232,"nvidia":233,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":234,"9wqyp7ny93xrs":235,"07":236,"fifth":237,"lp0gyjqr":238,"aws":239,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":240,"partnership":241,"officially":242,"supports":243,"llama":244,"fp8":245,"quantization":246,"pipeline":247,"parallelism":248,"23":249,"llama31":250,"06":251,"fourth":252,"agivllm":253,"cloudflare":254,"bentoml":255,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":256,"third":257,"robloxandvllmmeetup2024":258,"splashthat":259,"roblox":260,"1a":261,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":262,"second":263,"ygxbpzhl":264,"ibm":265,"12mi2skabnuw5rbwxdyy":266,"hthth4imsnceoq10jdqbxga":267,"2023":268,"a16z":269,"1ql":270,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":271,"would":272,"like":273,"express":274,"sincere":275,"gratitude":276,"andreessen":277,"horowitz":278,"30":279,"supporting":280,"open":281,"community":282,"providing":283,"generous":284,"grant":285,"development":286,"research":287,"released":288,"fastchat":289,"integration":290,"has":291,"powered":292,"lmsys":293,"vicuna":294,"chatbot":295,"arena":296,"chat":297,"since":298,"mid":299,"april":300,"use":301,"library":302,"originally":303,"developed":304,"sky":305,"computing":306,"lab":307,"cs":308,"berkeley":309,"edu":310,"uc":311,"evolved":312,"driven":313,"both":314,"academia":315,"industry":316,"state":317,"art":318,"throughput":319,"efficient":320,"management":321,"attention":322,"key":323,"value":324,"memory":325,"pagedattention":326,"20":327,"continuous":328,"batching":329,"incoming":330,"requests":331,"model":332,"cuda":333,"hip":334,"graph":335,"quantizations":336,"gptq":337,"2210":338,"17323":339,"awq":340,"2306":341,"00978":342,"autoround":343,"05516":344,"int4":345,"int8":346,"kernels":347,"including":348,"flashattention":349,"flashinfer":350,"speculative":351,"decoding":352,"chunked":353,"prefill":354,"flexible":355,"seamless":356,"popular":357,"hugging":358,"face":359,"models":360,"high":361,"various":362,"algorithms":363,"parallel":364,"sampling":365,"beam":366,"search":367,"tensor":368,"data":369,"expert":370,"distributed":371,"streaming":372,"outputs":373,"openai":374,"compatible":375,"api":376,"server":377,"gpus":378,"cpus":379,"intel":380,"powerpc":381,"tpu":382,"neuron":383,"multi":384,"lora":385,"seamlessly":386,"most":387,"huggingface":388,"transformer":389,"llms":390,"mixture":391,"mixtral":392,"deepseek":393,"v2":394,"v3":395,"embedding":396,"e5":397,"mistral":398,"modal":399,"llava":400,"full":401,"supported":402,"supported_models":403,"install":404,"pip":405,"getting_started":406,"installation":407,"gpu":408,"index":409,"build":410,"wheel":411,"bash":412,"visit":413,"quickstart":414,"welcome":415,"any":416,"collaborations":417,"how":418,"get":419,"involved":420,"compute":421,"resources":422,"testing":423,"following":424,"organizations":425,"thank":426,"your":427,"note":428,"sort":429,"them":430,"alphabetical":431,"order":432,"keep":433,"consistent":434,"sponsors":435,"md":436,"cash":437,"donations":438,"dropbox":439,"sequoia":440,"capital":441,"skywork":442,"zhenfund":443,"alibaba":444,"anyscale":445,"crusoe":446,"databricks":447,"deepinfra":448,"lambda":449,"nebius":450,"novita":451,"replicate":452,"runpod":453,"trainy":454,"san":455,"diego":456,"sponsor":457,"also":458,"official":459,"fundraising":460,"venue":461,"through":462,"opencollective":463,"plan":464,"fund":465,"maintenance":466,"adoption":467,"cite":468,"bibtex":469,"inproceedings":470,"kwon2023efficient":471,"title":472,"language":473,"author":474,"woosuk":475,"kwon":476,"zhuohan":477,"li":478,"siyuan":479,"zhuang":480,"ying":481,"sheng":482,"lianmin":483,"zheng":484,"cody":485,"hao":486,"yu":487,"joseph":488,"gonzalez":489,"zhang":490,"ion":491,"stoica":492,"booktitle":493,"proceedings":494,"acm":495,"sigops":496,"29th":497,"symposium":498,"operating":499,"systems":500,"principles":501,"year":502,"start":503,"contact":504,"technical":505,"questions":506,"feature":507,"github":508,"issues":509,"fellow":510,"security":511,"disclosures":512,"advisories":513,"partnerships":514,"lists":515,"mailto":516,"end":517,"wish":518,"refer":519,"kit":520,"repo":521,"spdx":522,"license":523,"identifier":524,"apache":525,"filecopyrighttext":526,"copyright":527,"import":528,"ctypes":529,"importlib":530,"util":531,"json":532,"logging":533,"os":534,"re":535,"shutil":536,"subprocess":537,"sys":538,"pathlib":539,"path":540,"which":541,"torch":542,"packaging":543,"version":544,"parse":545,"setuptools":546,"extension":547,"setup":548,"command":549,"build_ext":550,"setuptools_scm":551,"get_version":552,"utils":553,"cpp_extension":554,"cuda_home":555,"rocm_home":556,"def":557,"load_module_from_path":558,"module_name":559,"spec":560,"spec_from_file_location":561,"module":562,"module_from_spec":563,"modules":564,"loader":565,"exec_module":566,"return":567,"root_dir":568,"__file__":569,"parent":570,"logger":571,"getlogger":572,"__name__":573,"cannot":574,"envs":575,"directly":576,"because":577,"depends":578,"installed":579,"yet":580,"py":581,"vllm_target_device":582,"platform":583,"startswith":584,"darwin":585,"cpu":586,"warning":587,"automatically":588,"set":589,"due":590,"macos":591,"elif":592,"linux":593,"only":594,"wsl":595,"building":596,"so":597,"able":598,"run":599,"correctly":600,"empty":601,"none":602,"getenv":603,"available":604,"fallback":605,"main_cuda_version":606,"is_sccache_available":607,"bool":608,"sccache":609,"int":610,"vllm_disable_sccache":611,"is_ccache_available":612,"ccache":613,"is_ninja_available":614,"ninja":615,"is_url_available":616,"url":617,"str":618,"urllib":619,"request":620,"urlopen":621,"status":622,"try":623,"except":624,"exception":625,"false":626,"200":627,"class":628,"cmakeextension":629,"__init__":630,"self":631,"name":632,"cmake_lists_dir":633,"kwa":634,"super":635,"sources":636,"py_limited_api":637,"true":638,"abspath":639,"cmake_build_ext":640,"dict":641,"directories":642,"been":643,"configured":644,"did_config":645,"determine":646,"number":647,"compilation":648,"jobs":649,"optionally":650,"nvcc":651,"compile":652,"threads":653,"compute_num_jobs":654,"num_jobs":655,"either":656,"max_jobs":657,"environment":658,"variable":659,"defined":660,"info":661,"using":662,"else":663,"sched_getaffinity":664,"isn":665,"universally":666,"fall":667,"back":668,"cpu_count":669,"error":670,"len":671,"attributeerror":672,"nvcc_threads":673,"_is_cuda":674,"get_nvcc_cuda_version":675,"when":676,"reduce":677,"avoid":678,"overloading":679,"system":680,"max":681,"perform":682,"cmake":683,"configuration":684,"single":685,"configure":686,"ext":687,"ve":688,"already":689,"cmakelists":690,"txt":691,"exit":692,"early":693,"select":694,"type":695,"optimization":696,"level":697,"debug":698,"default_cfg":699,"relwithdebinfo":700,"cfg":701,"cmake_build_type":702,"cmake_args":703,"dcmake_build_type":704,"format":705,"dvllm_target_device":706,"verbose":707,"dcmake_verbose_makefile":708,"dcmake_c_compiler_launcher":709,"dcmake_cxx_compiler_launcher":710,"dcmake_cuda_compiler_launcher":711,"dcmake_hip_compiler_launcher":712,"pass":713,"python":714,"executable":715,"can":716,"exact":717,"match":718,"dvllm_python_executable":719,"reuse":720,"dependencies":721,"subsequent":722,"calls":723,"dvllm_python_path":724,"override":725,"base":726,"directory":727,"fetchcontent":728,"downloads":729,"root":730,"deps":731,"allows":732,"between":733,"profiles":734,"plays":735,"nicely":736,"fetchcontent_base_dir":737,"fc_base_dir":738,"environ":739,"dfetchcontent_base_dir":740,"tool":741,"dnvcc_threads":742,"build_tool":743,"dcmake_job_pool_compile":744,"string":745,"dcmake_job_pools":746,"default":747,"whatever":748,"picks":749,"make":750,"sure":751,"dcmake_cuda_compiler":752,"bin":753,"check_call":754,"cwd":755,"build_temp":756,"build_extensions":757,"ensure":758,"present":759,"working":760,"check_output":761,"oserror":762,"raise":763,"runtimeerror":764,"create":765,"does":766,"exist":767,"exists":768,"makedirs":769,"targets":770,"target_name":771,"removeprefix":772,"vllm_flash_attn":773,"all":774,"extensions":775,"append":776,"build_args":777,"target":778,"libraries":779,"proper":780,"location":781,"outdir":782,"get_ext_fullpath":783,"absolute":784,"skip":785,"same":786,"continue":787,"appends":788,"contains":789,"need":790,"remove":791,"range":792,"count":793,"should":794,"actually":795,"components":796,"install_args":797,"component":798,"standard":799,"copy":800,"build_lib":801,"current":802,"included":803,"editable":804,"glob":805,"files":806,"recursive":807,"dst_file":808,"split":809,"print":810,"copying":811,"dirname":812,"exist_ok":813,"copy_file":814,"precompiled_build_ext":815,"disables":816,"precompiled":817,"binaries":818,"assert":819,"vllm_use_precompiled":820,"builds":821,"skipping":822,"precompiled_wheel_utils":823,"extracts":824,"existing":825,"staticmethod":826,"extract_precompiled_and_patch_package":827,"wheel_url_or_path":828,"tempfile":829,"zipfile":830,"temp_dir":831,"isfile":832,"wheel_filename":833,"mkdtemp":834,"wheels":835,"wheel_path":836,"downloading":837,"urlretrieve":838,"filename":839,"package_data_patch":840,"files_to_copy":841,"_c":842,"abi3":843,"_moe_c":844,"_flashmla_c":845,"_vllm_fa2_c":846,"_vllm_fa3_c":847,"cumem_allocator":848,"compiled_regex":849,"file_members":850,"filter":851,"filelist":852,"extract":853,"target_path":854,"wb":855,"dst":856,"copyfileobj":857,"pkg":858,"replace":859,"setdefault":860,"basename":861,"finally":862,"removing":863,"temporary":864,"rmtree":865,"get_base_commit_in_main_branch":866,"force":867,"nightly":868,"mainly":869,"used":870,"ci":871,"vllm_test_use_precompiled_nightly_wheel":872,"commit":873,"hash":874,"upstream":875,"branch":876,"resp_json":877,"curl":878,"repos":879,"commits":880,"decode":881,"utf":882,"upstream_main_commit":883,"loads":884,"sha":885,"docker":886,"context":887,"git":888,"immutable":889,"missing":890,"vllm_docker_build_context":891,"local":892,"cat":893,"calledprocesserror":894,"fetch":895,"remote":896,"repository":897,"update":898,"branches":899,"ensures":900,"ref":901,"its":902,"history":903,"current_branch":904,"show":905,"strip":906,"base_commit":907,"merge":908,"valueerror":909,"err":910,"failed":911,"dev":912,"_no_device":913,"has_cuda":914,"_is_neuron":915,"_is_tpu":916,"_is_hip":917,"rocm":918,"_is_cpu":919,"_is_xpu":920,"xpu":921,"_build_custom_ops":922,"get_rocm_version":923,"librocm":924,"core":925,"see":926,"blob":927,"d11f5c20d500f729c393680a01fa902ebf92094b":928,"rocm_version":929,"cpp":930,"l21":931,"librocm_core_file":932,"lib":933,"is_file":934,"librocm_core":935,"cdll":936,"vererrors":937,"c_uint32":938,"get_rocm_core_version":939,"getrocmversion":940,"restype":941,"argtypes":942,"pointer":943,"minor":944,"patch":945,"byref":946,"get_neuronxcc_version":947,"sysconfig":948,"site_dir":949,"get_paths":950,"purelib":951,"version_file":952,"neuronxcc":953,"executed":954,"successfully":955,"fp":956,"content":957,"read":958,"regular":959,"expression":960,"__version__":961,"group":962,"could":963,"output":964,"adapted":965,"apex":966,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":967,"nvcc_output":968,"universal_newlines":969,"release_idx":970,"nvcc_cuda_version":971,"get_gaudi_sw_version":972,"returns":973,"driver":974,"enable":975,"console":976,"printing":977,"hl":978,"smi":979,"shell":980,"capture_output":981,"env":982,"enable_console":983,"returncode":984,"stdout":985,"get_vllm_version":986,"write_to":987,"_version":988,"sep":989,"versions":990,"might":991,"contain":992,"cuda_version":993,"cuda_version_str":994,"tarball":995,"required":996,"pypi":997,"sdist":998,"argv":999,"cu":1000,"neuron_version":1001,"neuron_version_str":1002,"unknown":1003,"runtime":1004,"get_requirements":1005,"package":1006,"requirements":1007,"requirements_dir":1008,"_read_requirements":1009,"resolved_requirements":1010,"line":1011,"common":1012,"cuda_major":1013,"cuda_minor":1014,"modified_requirements":1015,"req":1016,"flash":1017,"attn":1018,"built":1019,"unsupported":1020,"ext_modules":1021,"_rocm_c":1022,"fa3":1023,"requires":1024,"later":1025,"optional":1026,"doesn":1027,"produce":1028,"targeting":1029,"hopper":1030,"package_data":1031,"typed":1032,"model_executor":1033,"layers":1034,"fused_moe":1035,"configs":1036,"advance":1037,"wheel_location":1038,"vllm_precompiled_wheel_location":1039,"wheel_url":1040,"cp38":1041,"manylinux1_x86_64":1042,"whl":1043,"resp":1044,"warn":1045,"falling":1046,"items":1047,"extend":1048,"cmdclass":1049,"static":1050,"metadata":1051,"rather":1052,"go":1053,"pyproject":1054,"toml":1055,"install_requires":1056,"extras_require":1057,"bench":1058,"pandas":1059,"datasets":1060,"tensorizer":1061,"fastsafetensors":1062,"runai":1063,"streamer":1064,"13":1065,"s3":1066,"boto3":1067,"audio":1068,"librosa":1069,"soundfile":1070,"mistral_common":1071,"processing":1072,"video":1073,"kept":1074,"backwards":1075,"compatibility":1076,"updated":1077,"together":1078,"dockerfile":1079,"requires_files":1080,"cleaning":1081,"lines":1082,"readlines":1083,"lower":1084,"removed":1085,"write":1086,"done":1087,"releases":1088,"offer":1089,"reliable":1090,"packaged":1091,"binary":1092,"conveniently":1093,"accessed":1094,"via":1095,"serve":1096,"milestones":1097,"communicate":1098,"newly":1099,"improvements":1100,"upcoming":1101,"changes":1102,"affect":1103,"potential":1104,"breaking":1105,"uses":1106,"right":1107,"shifted":1108,"versioning":1109,"where":1110,"new":1111,"every":1112,"weeks":1113,"bug":1114,"fixes":1115,"opposed":1116,"semver":1117,"critical":1118,"made":1119,"post1":1120,"_major_":1121,"milestone":1122,"incompatible":1123,"similar":1124,"_minor_":1125,"_patch_":1126,"_post1_":1127,"_patch":1128,"1_":1129,"explicit":1130,"implicit":1131,"bi":1132,"weekly":1133,"basis":1134,"days":1135,"after":1136,"cadence":1137,"future":1138,"dates":1139,"below":1140,"tentative":1141,"date":1142,"jan":1143,"feb":1144,"mar":1145,"apr":1146,"jun":1147,"jul":1148,"aug":1149,"14":1150,"15":1151,"16":1152,"17":1153,"oct":1154,"18":1155,"19":1156,"nov":1157,"21":1158,"dec":1159,"22":1160,"each":1161,"dedicated":1162,"cut":1163,"performed":1164,"before":1165,"previously":1166,"reused":1167,"triggered":1168,"push":1169,"rc":1170,"tag":1171,"vx":1172,"rc1":1173,"enables":1174,"test":1175,"multiple":1176,"rcs":1177,"final":1178,"trigger":1179,"notes":1180,"monitor":1181,"reverts":1182,"apply":1183,"approach":1184,"finalizing":1185,"clear":1186,"criteria":1187,"what":1188,"cherry":1189,"allowed":1190,"pick":1191,"process":1192,"land":1193,"pr":1194,"typically":1195,"sufficient":1196,"time":1197,"complete":1198,"thorough":1199,"round":1200,"stable":1201,"regression":1202,"address":1203,"functional":1204,"performance":1205,"against":1206,"recent":1207,"severe":1208,"issue":1209,"silent":1210,"incorrectness":1211,"crashes":1212,"deadlocks":1213,"leaks":1214,"introduced":1215,"specific":1216,"change":1217,"identifiers":1218,"work":1219,"prs":1220,"considered":1221,"merged":1222,"trunk":1223,"validation":1224,"regressions":1225,"benchmark":1226,"workflow":1227,"actions":1228,"workflows":1229,"yml":1230,"coverage":1231,"llama3":1232,"llama4":1233,"hardware":1234,"h100":1235,"mi300x":1236,"_note":1237,"based":1238,"availability_":1239,"step":1240,"access":1241,"review":1242,"familiarize":1243,"yourself":1244,"configurations":1245,"tree":1246,"benchmarks":1247,"navigate":1248,"v0":1249,"results":1250,"once":1251,"completes":1252,"dashboard":1253,"hud":1254,"reponame":1255,"2fvllm":1256,"corresponding":1257,"comparison":1258,"compare":1259,"verify":1260,"occurred":1261,"example":1262,"vs":1263,"starttime":1264,"thu":1265,"2c":1266,"2017":1267,"20apr":1268,"202025":1269,"2021":1270,"3a43":1271,"3a50":1272,"20gmt":1273,"stoptime":1274,"wed":1275,"2016":1276,"20jul":1277,"granularity":1278,"week":1279,"lbranch":1280,"lcommit":1281,"b6553be1bc75f046b00046a4ad7576364d03c835":1282,"rbranch":1283,"rcommit":1284,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1285,"benchmarkname":1286,"modelname":1287,"20models":1288,"backendname":1289,"20backends":1290,"modename":1291,"20modes":1292,"dtypename":1293,"20dtype":1294,"devicename":1295,"20devices":1296,"archname":1297,"20platforms":1298,"members":1299,"leaders":1300,"pledge":1301,"participation":1302,"harassment":1303,"experience":1304,"regardless":1305,"age":1306,"body":1307,"size":1308,"visible":1309,"invisible":1310,"disability":1311,"ethnicity":1312,"sex":1313,"characteristics":1314,"gender":1315,"identity":1316,"education":1317,"socioeconomic":1318,"nationality":1319,"personal":1320,"appearance":1321,"race":1322,"caste":1323,"religion":1324,"sexual":1325,"orientation":1326,"act":1327,"interact":1328,"ways":1329,"contribute":1330,"welcoming":1331,"diverse":1332,"inclusive":1333,"healthy":1334,"examples":1335,"behavior":1336,"contributes":1337,"positive":1338,"include":1339,"demonstrating":1340,"empathy":1341,"kindness":1342,"toward":1343,"people":1344,"being":1345,"respectful":1346,"differing":1347,"opinions":1348,"viewpoints":1349,"experiences":1350,"giving":1351,"gracefully":1352,"accepting":1353,"constructive":1354,"feedback":1355,"responsibility":1356,"apologizing":1357,"those":1358,"affected":1359,"mistakes":1360,"learning":1361,"best":1362,"individuals":1363,"overall":1364,"unacceptable":1365,"sexualized":1366,"imagery":1367,"advances":1368,"kind":1369,"trolling":1370,"insulting":1371,"derogatory":1372,"comments":1373,"political":1374,"attacks":1375,"public":1376,"private":1377,"publishing":1378,"others":1379,"physical":1380,"email":1381,"without":1382,"permission":1383,"conduct":1384,"reasonably":1385,"inappropriate":1386,"professional":1387,"setting":1388,"responsible":1389,"clarifying":1390,"enforcing":1391,"standards":1392,"acceptable":1393,"take":1394,"appropriate":1395,"fair":1396,"corrective":1397,"action":1398,"response":1399,"deem":1400,"threatening":1401,"offensive":1402,"harmful":1403,"reject":1404,"wiki":1405,"edits":1406,"aligned":1407,"reasons":1408,"moderation":1409,"decisions":1410,"applies":1411,"within":1412,"spaces":1413,"individual":1414,"representing":1415,"posting":1416,"social":1417,"account":1418,"acting":1419,"appointed":1420,"representative":1421,"online":1422,"offline":1423,"irl":1424,"instances":1425,"abusive":1426,"harassing":1427,"otherwise":1428,"reported":1429,"enforcement":1430,"channel":1431,"complaints":1432,"reviewed":1433,"investigated":1434,"promptly":1435,"fairly":1436,"obligated":1437,"respect":1438,"privacy":1439,"reporter":1440,"incident":1441,"follow":1442,"impact":1443,"guidelines":1444,"determining":1445,"consequences":1446,"violation":1447,"deemed":1448,"unprofessional":1449,"unwelcome":1450,"consequence":1451,"written":1452,"clarity":1453,"around":1454,"nature":1455,"explanation":1456,"why":1457,"apology":1458,"requested":1459,"series":1460,"continued":1461,"interaction":1462,"unsolicited":1463,"specified":1464,"period":1465,"includes":1466,"avoiding":1467,"interactions":1468,"well":1469,"external":1470,"channels":1471,"violating":1472,"terms":1473,"lead":1474,"permanent":1475,"ban":1476,"serious":1477,"sustained":1478,"communication":1479,"during":1480,"pattern":1481,"aggression":1482,"disparagement":1483,"classes":1484,"contributor":1485,"covenant":1486,"code_of_conduct":1487,"were":1488,"inspired":1489,"mozilla":1490,"ladder":1491,"inclusion":1492,"answers":1493,"faq":1494,"translations":1495,"traceback":1496,"typing":1497,"callable":1498,"unittest":1499,"mock":1500,"find_cuda_init":1501,"fn":1502,"object":1503,"helper":1504,"function":1505,"initialization":1506,"errors":1507,"initializes":1508,"prints":1509,"stack":1510,"trace":1511,"happens":1512,"_lazy_init":1513,"wrapper":1514,"nonlocal":1515,"extract_stack":1516,"initialized":1517,"format_list":1518,"__main__":1519,"import_module":1520,"report":1521,"privately":1522,"vulnerability":1523,"submission":1524,"form":1525,"reports":1526,"triaged":1527,"vulnerability_management":1528,"guide":1529,"usage":1530,"assumptions":1531,"recommendations":1532,"policy":1533,"securely":1534,"risk":1535,"taking":1536,"dealing":1537,"past":1538,"defaults":1539,"cases":1540,"severity":1541,"categories":1542,"vulnerabilities":1543,"allow":1544,"attackers":1545,"execute":1546,"arbitrary":1547,"control":1548,"significantly":1549,"compromise":1550,"confidentiality":1551,"integrity":1552,"privileges":1553,"needed":1554,"network":1555,"deserialization":1556,"exploit":1557,"chains":1558,"generally":1559,"rated":1560,"cvss":1561,"flaws":1562,"elevated":1563,"rce":1564,"contexts":1565,"significant":1566,"loss":1567,"require":1568,"advanced":1569,"conditions":1570,"some":1571,"trust":1572,"modes":1573,"node":1574,"privileged":1575,"scores":1576,"cause":1577,"denial":1578,"service":1579,"partial":1580,"disruption":1581,"do":1582,"breach":1583,"rating":1584,"informational":1585,"non":1586,"exploitable":1587,"weaknesses":1588,"privilege":1589,"negligible":1590,"side":1591,"collisions":1592,"often":1593,"less":1594,"than":1595,"certain":1596,"moderate":1597,"prenotify":1598,"vendors":1599,"ship":1600,"purpose":1601,"prenotification":1602,"coordinated":1603,"notification":1604,"adding":1605,"contacts":1606,"advisory":1607,"few":1608,"added":1609,"send":1610,"vendor":1611,"analyzed":1612,"case":1613,"withdraw":1614,"receiving":1615,"prenotifications":1616,"membership":1617,"refinements":1618,"who":1619,"samplingparams":1620,"creates":1621,"xla":1622,"hlo":1623,"graphs":1624,"length":1625,"buckets":1626,"neuron_context_length_buckets":1627,"128":1628,"512":1629,"1024":1630,"2048":1631,"token":1632,"gen":1633,"neuron_token_gen_buckets":1634,"quantizes":1635,"weight":1636,"config":1637,"dtype":1638,"neuron_quant_dtype":1639,"s8":1640,"sample":1641,"prompts":1642,"hello":1643,"my":1644,"president":1645,"united":1646,"states":1647,"france":1648,"params":1649,"sampling_params":1650,"temperature":1651,"top_p":1652,"95":1653,"tinyllama":1654,"1b":1655,"max_num_seqs":1656,"max_model_len":1657,"block_size":1658,"arguments":1659,"sequence":1660,"device":1661,"currently":1662,"known":1663,"limitation":1664,"transformers":1665,"neuronx":1666,"todo":1667,"liangfu":1668,"paged":1669,"ruff":1670,"noqa":1671,"e501":1672,"detected":1673,"sdk":1674,"argument":1675,"unspecified":1676,"automated":1677,"detection":1678,"explicitly":1679,"assigned":1680,"neuron_quant":1681,"override_neuron_config":1682,"cast_logits_dtype":1683,"bfloat16":1684,"tensor_parallel_size":1685,"generate":1686,"texts":1687,"requestoutput":1688,"objects":1689,"prompt":1690,"generated":1691,"50":1692,"generated_text":1693,"ngenerated":1694,"saves":1695,"worker":1696,"checkpoint":1697,"load":1698,"needs":1699,"own":1700,"shard":1701,"entire":1702,"save_sharded_state":1703,"deepspeedfp":1704,"save":1705,"loaded":1706,"load_format":1707,"sharded_state":1708,"dataclasses":1709,"engineargs":1710,"model_loader":1711,"shardedstateloader":1712,"flexibleargumentparser":1713,"parse_args":1714,"parser":1715,"add_cli_args":1716,"add_argument":1717,"help":1718,"default_pattern":1719,"saved":1720,"filenames":1721,"bytes":1722,"safetensors":1723,"args":1724,"engine_args":1725,"from_cli_args":1726,"enable_lora":1727,"saving":1728,"model_path":1729,"is_dir":1730,"must":1731,"instance":1732,"asdict":1733,"prepare":1734,"mkdir":1735,"dump":1736,"engine":1737,"is_v1_engine":1738,"hasattr":1739,"llm_engine":1740,"engine_core":1741,"file_pattern":1742,"max_size":1743,"max_file_size":1744,"listdir":1745,"splitext":1746,"pt":1747,"isdir":1748,"copytree":1749,"offline_inference":1750,"data_parallel":1751,"powermoe":1752,"3b":1753,"dp":1754,"tp":1755,"assume":1756,"ip":1757,"99":1758,"48":1759,"rank":1760,"master":1761,"addr":1762,"port":1763,"13345":1764,"sleep":1765,"get_open_port":1766,"argparse":1767,"argumentparser":1768,"description":1769,"total":1770,"nodes":1771,"enforce":1772,"eager":1773,"store_true":1774,"mode":1775,"num":1776,"seqs":1777,"64":1778,"maximum":1779,"sequences":1780,"processed":1781,"iteration":1782,"tokens":1783,"timeout":1784,"300":1785,"seconds":1786,"unresponsive":1787,"killed":1788,"utilization":1789,"float":1790,"fraction":1791,"allocate":1792,"dp_size":1793,"local_dp_rank":1794,"global_dp_rank":1795,"dp_master_ip":1796,"dp_master_port":1797,"gpus_per_dp_rank":1798,"enforce_eager":1799,"trust_remote_code":1800,"gpu_memory_utilization":1801,"vllm_dp_rank":1802,"vllm_dp_rank_local":1803,"vllm_dp_size":1804,"vllm_dp_master_ip":1805,"vllm_dp_master_port":1806,"cuda_visible_devices":1807,"inside":1808,"processes":1809,"100":1810,"different":1811,"usually":1812,"ranks":1813,"dataset":1814,"part":1815,"floor":1816,"remainder":1817,"distribute":1818,"even":1819,"groups":1820,"min":1821,"placeholder":1822,"doing":1823,"max_tokens":1824,"demonstration":1825,"enable_expert_parallel":1826,"enumerate":1827,"break":1828,"give":1829,"engines":1830,"pause":1831,"loops":1832,"exiting":1833,"tp_size":1834,"node_size":1835,"node_rank":1836,"127":1837,"master_addr":1838,"master_port":1839,"divisible":1840,"dp_per_node":1841,"multiprocessing":1842,"procs":1843,"proc":1844,"exit_code":1845,"exitcode":1846,"killing":1847,"pid":1848,"didn":1849,"stop":1850,"minutes":1851,"kill":1852,"demonstrates":1853,"co":1854,"locate":1855,"training":1856,"actors":1857,"reinforcement":1858,"human":1859,"rlhf":1860,"workloads":1861,"serves":1862,"framework":1863,"placement":1864,"workers":1865,"bundles":1866,"enabling":1867,"two":1868,"script":1869,"shows":1870,"variables":1871,"vllm_ray_per_worker_gpus":1872,"vllm_ray_bundle_indices":1873,"desired":1874,"devices":1875,"exchange":1876,"tensors":1877,"means":1878,"inter":1879,"ipc":1880,"sidesteps":1881,"nccl":1882,"limitations":1883,"occur":1884,"share":1885,"assumes":1886,"cluster":1887,"four":1888,"clusters":1889,"expects":1890,"exclusive":1891,"profiling":1892,"residual":1893,"activity":1894,"interferes":1895,"causes":1896,"unexpected":1897,"io":1898,"placement_group":1899,"scheduling_strategies":1900,"placementgroupschedulingstrategy":1901,"myllm":1902,"constructor":1903,"sets":1904,"encode":1905,"bundle":1906,"indices":1907,"positional":1908,"forwarded":1909,"bundle_indices":1910,"kwargs":1911,"keyword":1912,"prevent":1913,"manipulating":1914,"top":1915,"pop":1916,"fit":1917,"map":1918,"creating":1919,"raytrainingactor":1920,"actor":1921,"hosts":1922,"facebook":1923,"opt":1924,"125m":1925,"onto":1926,"expose":1927,"handles":1928,"colocated":1929,"automodelforcausallm":1930,"from_pretrained":1931,"parameters":1932,"named_parameters":1933,"zero_":1934,"synchronize":1935,"get_device_uuid":1936,"platforms":1937,"current_platform":1938,"device_uuid":1939,"report_device_id":1940,"get_weight_ipc_handles":1941,"reductions":1942,"reduce_tensor":1943,"hold":1944,"subset":1945,"weights":1946,"gather":1947,"purposes":1948,"owns":1949,"detach":1950,"manages":1951,"init":1952,"pg":1953,"ready":1954,"bundle_specs":1955,"training_actors":1956,"training_actor_device_ids":1957,"inference_engines":1958,"inference_engine_device_ids":1959,"bundle_index":1960,"training_actor":1961,"num_cpus":1962,"num_gpus":1963,"scheduling_strategy":1964,"placement_group_capture_child_tasks":1965,"placement_group_bundle_index":1966,"device_id":1967,"syntax":1968,"instead":1969,"decorator":1970,"customized":1971,"worker_extension_cls":1972,"rlhf_utils":1973,"colocateworkerextension":1974,"distributed_executor_backend":1975,"call":1976,"method":1977,"point":1978,"blocks":1979,"until":1980,"finishes":1981,"collective_rpc":1982,"tuple":1983,"last":1984,"ipc_handles":1985,"update_weights_from_ipc_handles":1986,"check_weights_changed":1987,"generation":1988,"comparing":1989,"still":1990,"vllm_use_v1":1991,"mlpspeculator":1992,"gc":1993,"time_generation":1994,"warmup":1995,"sum":1996,"token_ids":1997,"template":1998,"instruction":1999,"describes":2000,"task":2001,"appropriately":2002,"13b":2003,"hf":2004,"speculation":2005,"del":2006,"collect":2007,"speculative_config":2008,"accelerator":2009,"profiler":2010,"cmd":2011,"vllm_torch_profiler_dir":2012,"vllm_profile":2013,"start_profile":2014,"stop_profile":2015,"add":2016,"buffer":2017,"wait":2018,"background":2019,"finish":2020,"writing":2021,"running":2022,"correct":2023,"namedtuple":2024,"huggingface_hub":2025,"snapshot_download":2026,"autotokenizer":2027,"audioasset":2028,"lorarequest":2029,"audio_assets":2030,"mary_had_lamb":2031,"winning_call":2032,"question_per_audio_count":2033,"recited":2034,"sport":2035,"nursery":2036,"rhyme":2037,"referenced":2038,"modelrequestdata":2039,"prompt_token_ids":2040,"multi_modal_data":2041,"stop_token_ids":2042,"lora_requests":2043,"result":2044,"oom":2045,"unless":2046,"settings":2047,"tested":2048,"l4":2049,"voxtral":2050,"run_voxtral":2051,"question":2052,"audio_count":2053,"protocol":2054,"instruct":2055,"messages":2056,"audiochunk":2057,"rawaudio":2058,"textchunk":2059,"usermessage":2060,"chatcompletionrequest":2061,"tokenizers":2062,"mistraltokenizer":2063,"model_name":2064,"mistralai":2065,"mini":2066,"2507":2067,"tokenizer":2068,"from_hf_hub":2069,"8192":2070,"limit_mm_per_prompt":2071,"config_format":2072,"tokenizer_mode":2073,"enable_chunked_prefill":2074,"text_chunk":2075,"audios":2076,"from_file":2077,"get_local_path":2078,"strict":2079,"audio_chunks":2080,"input_audio":2081,"from_audio":2082,"encode_chat_completion":2083,"prompt_ids":2084,"audios_and_sr":2085,"au":2086,"audio_array":2087,"sampling_rate":2088,"gemma3n":2089,"run_gemma3n":2090,"gemma":2091,"3n":2092,"e2b":2093,"max_num_batched_tokens":2094,"start_of_turn":2095,"audio_soft_token":2096,"end_of_turn":2097,"granite":2098,"speech":2099,"run_granite_speech":2100,"somehat":2101,"optimal":2102,"recommended":2103,"readme":2104,"suggested":2105,"8b":2106,"max_lora_rank":2107,"dir":2108,"enabled":2109,"whenever":2110,"inputs":2111,"speech_lora_path":2112,"audio_placeholder":2113,"start_of_role":2114,"end_of_role":2115,"knowledge":2116,"cutoff":2117,"ntoday":2118,"december":2119,"nyou":2120,"helpful":2121,"assistant":2122,"end_of_text":2123,"minicpm":2124,"run_minicpmo":2125,"openbmb":2126,"2_6":2127,"4096":2128,"stop_tokens":2129,"im_end":2130,"endoftext":2131,"convert_tokens_to_ids":2132,"audio_chat_template":2133,"message":2134,"im_start":2135,"role":2136,"endfor":2137,"add_generation_prompt":2138,"spk_bos":2139,"spk":2140,"spk_eos":2141,"tts_bos":2142,"endif":2143,"apply_chat_template":2144,"tokenize":2145,"chat_template":2146,"phi":2147,"run_phi4mm":2148,"image":2149,"microsoft":2150,"vision":2151,"manually":2152,"specify":2153,"placeholders":2154,"audio_":2155,"12800":2156,"320":2157,"run_phi4_multimodal":2158,"revision":2159,"refs":2160,"70":2161,"qwen2":2162,"run_qwen2_audio":2163,"qwen":2164,"7b":2165,"audio_in_prompt":2166,"idx":2167,"audio_bos":2168,"audio_eos":2169,"omni":2170,"run_qwen2_5_omni":2171,"default_system":2172,"virtual":2173,"capable":2174,"perceiving":2175,"auditory":2176,"visual":2177,"generating":2178,"ultravox":2179,"run_ultravox":2180,"fixie":2181,"v0_5":2182,"3_2":2183,"whisper":2184,"run_whisper":2185,"input":2186,"per":2187,"turbo":2188,"startoftranscript":2189,"448":2190,"model_example_map":2191,"granite_speech":2192,"minicpmo":2193,"phi4_mm":2194,"phi4_multimodal":2195,"qwen2_audio":2196,"qwen2_5_omni":2197,"demo":2198,"choices":2199,"keys":2200,"model_type":2201,"seed":2202,"initializing":2203,"num_audios":2204,"req_data":2205,"modalities":2206,"default_limits":2207,"identical":2208,"batch":2209,"mm_data":2210,"asset":2211,"audio_and_sample_rate":2212,"num_prompts":2213,"applicable":2214,"lora_request":2215,"add_dataset_parser":2216,"get_samples":2217,"metrics":2218,"reader":2219,"counter":2220,"vector":2221,"importerror":2222,"image_urls":2223,"upload":2224,"wikimedia":2225,"wikipedia":2226,"commons":2227,"da":2228,"2015_kaczka_krzy":2229,"c5":2230,"bcowka_w_wodzie_":2231,"28samiec":2232,"29":2233,"jpg":2234,"77":2235,"002_the_lion_king_snyggve_in_the_serengeti_national_park_photo_by_giles_laurent":2236,"26":2237,"ultramarine_flycatcher_":2238,"28ficedula_superciliaris":2239,"29_naggar":2240,"2c_himachal_pradesh":2241,"2c_2013_":2242,"28cropped":2243,"thumb":2244,"anim1754_":2245,"_flickr_":2246,"_noaa_photo_library_":2247,"281":2248,"2560px":2249,"d4":2250,"starfish":2251,"2c_caswell_bay_":2252,"_geograph":2253,"uk_":2254,"_409413":2255,"69":2256,"grapevinesnail_01":2257,"0b":2258,"texas_invasive_musk_thistle_1":2259,"1920px":2260,"7a":2261,"huskiesatrest":2262,"2880px":2263,"68":2264,"orange_tabby_cat_sitting_on_fallen_leaves":2265,"hisashi":2266,"01a":2267,"george_the_amazing_guinea_pig":2268,"1f":2269,"oryctolagus_cuniculus_rcdo":2270,"98":2271,"horse":2272,"pony":2273,"get_custom_mm_prompts":2274,"image_url":2275,"eagle":2276,"ngram":2277,"eagle3":2278,"mtp":2279,"lookup":2280,"temp":2281,"256":2282,"custom":2283,"mm":2284,"endpoint_type":2285,"model_dir":2286,"custom_mm_prompts":2287,"custom_skip_chat_template":2288,"add_special_tokens":2289,"bos":2290,"twice":2291,"templates":2292,"eagle_dir":2293,"yuhuili":2294,"num_speculative_tokens":2295,"num_spec_tokens":2296,"prompt_lookup_max":2297,"prompt_lookup_min":2298,"disable_log_stats":2299,"16384":2300,"disable_chunked_mm_input":2301,"output_len":2302,"print_output":2303,"get_metrics":2304,"assertionerror":2305,"total_num_output_tokens":2306,"num_drafts":2307,"num_draft_tokens":2308,"num_accepted_tokens":2309,"acceptance_counts":2310,"metric":2311,"spec_decode_num_drafts":2312,"isinstance":2313,"spec_decode_num_draft_tokens":2314,"spec_decode_num_accepted_tokens":2315,"spec_decode_num_accepted_tokens_per_pos":2316,"pos":2317,"values":2318,"acceptance_length":2319,"mean":2320,"acceptance":2321,"2f":2322,"position":2323,"acceptance_rate":2324,"disaggregated":2325,"prefilling":2326,"launch":2327,"transfer":2328,"kv":2329,"cache":2330,"kvtransferconfig":2331,"run_prefill":2332,"prefill_done":2333,"receives":2334,"while":2335,"three":2336,"receive":2337,"hi":2338,"tell":2339,"me":2340,"very":2341,"long":2342,"story":2343,"pyncclconnector":2344,"transmit":2345,"caches":2346,"kv_producer":2347,"ktc":2348,"kv_connector":2349,"kv_role":2350,"kv_rank":2351,"kv_parallel_size":2352,"a6000":2353,"40gb":2354,"adjust":2355,"kv_transfer_config":2356,"2000":2357,"finished":2358,"prematurely":2359,"causing":2360,"incomplete":2361,"keyboardinterrupt":2362,"stopped":2363,"run_decode":2364,"kv_consumer":2365,"producer":2366,"pipe":2367,"waiting":2368,"transferred":2369,"prefill_process":2370,"decode_process":2371,"terminate":2372,"namespace":2373,"pil":2374,"autoprocessor":2375,"fetch_image":2376,"image_data":2377,"load_aria":2378,"rhymes":2379,"aria":2380,"slow":2381,"fim_prefix":2382,"fim_suffix":2383,"93532":2384,"93653":2385,"944":2386,"93421":2387,"1019":2388,"93519":2389,"load_aya_vision":2390,"cohereforai":2391,"aya":2392,"processor":2393,"load_command_a_vision":2394,"coherelabs":2395,"122b":2396,"32768":2397,"load_deepseek_vl2":2398,"vl2":2399,"tiny":2400,"hf_overrides":2401,"architectures":2402,"deepseekvlv2forcausallm":2403,"image_":2404,"load_gemma3":2405,"4b":2406,"load_h2ovl":2407,"h2oai":2408,"h2ovl":2409,"mississippi":2410,"800m":2411,"mm_processor_kwargs":2412,"max_dynamic_patch":2413,"eos_token_id":2414,"load_hyperclovax_seed_vision":2415,"naver":2416,"hyperclovax":2417,"_image_url":2418,"ocr":2419,"lens_keywords":2420,"lens_local_keywords":2421,"load_idefics3":2422,"huggingfacem4":2423,"idefics3":2424,"confirmed":2425,"l40":2426,"longest_edge":2427,"optimizations":2428,"364":2429,"begin_of_text":2430,"end_of_utterance":2431,"nassistant":2432,"load_interns1":2433,"internlm":2434,"intern":2435,"s1":2436,"img_context":2437,"load_internvl":2438,"opengvlab":2439,"internvl2":2440,"2b":2441,"internvl":2442,"variants":2443,"card":2444,"words":2445,"conversation":2446,"load_llama4":2447,"scout":2448,"17b":2449,"16e":2450,"131072":2451,"load_llava":2452,"caution":2453,"original":2454,"wasn":2455,"really":2456,"trained":2457,"poor":2458,"load_llava_next":2459,"load_llava_onevision":2460,"onevision":2461,"ov":2462,"load_keye_vl":2463,"kwai":2464,"keye":2465,"vl":2466,"preview":2467,"load_kimi_vl":2468,"moonshotai":2469,"kimi":2470,"a3b":2471,"load_mistral3":2472,"small":2473,"24b":2474,"2503":2475,"necessary":2476,"ignore_patterns":2477,"consolidated":2478,"inst":2479,"load_mllama":2480,"11b":2481,"img_prompt":2482,"given":2483,"load_nvlm_d":2484,"nvlm":2485,"72b":2486,"ovis":2487,"load_ovis":2488,"aidc":2489,"ovis2":2490,"half":2491,"load_pixtral_hf":2492,"pixtral":2493,"12b":2494,"load_phi3v":2495,"num_crops":2496,"kwarg":2497,"frame":2498,"scenarios":2499,"speaking":2500,"larger":2501,"preprocessing":2502,"references":2503,"formula":2504,"transform":2505,"found":2506,"loading":2507,"locally":2508,"processing_phi3_v":2509,"l194":2510,"load_phi4mm":2511,"images":2512,"vision_lora_path":2513,"passed":2514,"dynamic_hd":2515,"load_phi4_multimodal":2516,"load_qwen_vl_chat":2517,"qwenvlforconditionalgeneration":2518,"attribute":2519,"chatml":2520,"qwen_generation_utils":2521,"l265":2522,"copied":2523,"chat_templating":2524,"load_qwen2_vl":2525,"qwen_vl_utils":2526,"smart_resize":2527,"modulenotfounderror":2528,"resized":2529,"functionality":2530,"post_process_image":2531,"height":2532,"resized_height":2533,"resized_width":2534,"max_pixels":2535,"28":2536,"resize":2537,"load_qwen2_5_vl":2538,"load_smolvlm":2539,"huggingfacetb":2540,"smolvlm2":2541,"max_image_size":2542,"384":2543,"load_step3":2544,"stepfun":2545,"step3":2546,"verified":2547,"8xh100":2548,"85":2549,"reasoning_parser":2550,"begin":2551,"sentence":2552,"bot":2553,"im_patch":2554,"eot":2555,"think":2556,"load_tarsier":2557,"tarsier":2558,"load_tarsier2":2559,"tarsier2":2560,"recap":2561,"tarsier2forconditionalgeneration":2562,"vision_start":2563,"image_pad":2564,"vision_end":2565,"aya_vision":2566,"command_a_vision":2567,"deepseek_vl_v2":2568,"gemma3":2569,"h2ovl_chat":2570,"hyperclovax_seed_vision":2571,"interns1":2572,"internvl_chat":2573,"keye_vl":2574,"kimi_vl":2575,"next":2576,"mistral3":2577,"mllama":2578,"nvlm_d":2579,"phi3_v":2580,"pixtral_hf":2581,"qwen_vl_chat":2582,"qwen2_vl":2583,"qwen2_5_vl":2584,"smolvlm":2585,"run_generate":2586,"run_chat":2587,"num_images":2588,"invalid":2589,"random":2590,"calling":2591,"want":2592,"client":2593,"http":2594,"8000":2595,"completions":2596,"header":2597,"application":2598,"authorization":2599,"bearer":2600,"describe":2601,"detail":2602,"amazonaws":2603,"cms":2604,"ipressroom":2605,"338":2606,"201808":2607,"5b894ee1a138352221103195_a680":2608,"7ejogging":2609,"a680":2610,"edit_hero":2611,"one":2612,"answer":2613,"french":2614,"wolframcloud":2615,"obj":2616,"resourcesystem":2617,"a0e":2618,"a0ee3983":2619,"46c6":2620,"4c92":2621,"b85d":2622,"059044639928":2623,"6af8cfb971db031b":2624,"simple":2625,"switch":2626,"nemo":2627,"2407":2628,"ability":2629,"generate_random_id":2630,"characters":2631,"ascii_letters":2632,"digits":2633,"random_id":2634,"choice":2635,"simulate":2636,"called":2637,"get_current_weather":2638,"city":2639,"unit":2640,"weather":2641,"degrees":2642,"partly":2643,"cloudly":2644,"highs":2645,"90":2646,"tool_functions":2647,"tools":2648,"properties":2649,"francisco":2650,"letter":2651,"abbreviation":2652,"ca":2653,"california":2654,"enum":2655,"celsius":2656,"fahrenheit":2657,"temperate":2658,"dallas":2659,"let":2660,"simulating":2661,"above":2662,"tool_calls":2663,"tool_answers":2664,"tool_call_id":2665,"yields":2666,"tx":2667,"separates":2668,"distinct":2669,"manage":2670,"occupies":2671,"whereas":2672,"performs":2673,"steps":2674,"across":2675,"broadcast":2676,"collective":2677,"rpc":2678,"simply":2679,"production":2680,"implementation":2681,"replicas":2682,"openrlhf":2683,"stateless_init_process_group":2684,"get_ip":2685,"workload":2686,"train_model":2687,"initialize":2688,"placed":2689,"reserves":2690,"pg_inference":2691,"scheduling_inference":2692,"flag":2693,"reduces":2694,"up":2695,"latency":2696,"workerextension":2697,"master_address":2698,"handle":2699,"init_weight_update_group":2700,"model_update_group":2701,"zeroing":2702,"real":2703,"gradient":2704,"rl":2705,"objective":2706,"ppo":2707,"reward":2708,"dtype_name":2709,"update_weight":2710,"shape":2711,"stream":2712,"current_stream":2713,"expected":2714,"nonsense":2715,"outputs_updated":2716,"llmengine":2717,"create_test_prompts":2718,"robot":2719,"injure":2720,"logprobs":2721,"prompt_logprobs":2722,"top_k":2723,"presence_penalty":2724,"meaning":2725,"life":2726,"frequency_penalty":2727,"process_requests":2728,"test_prompts":2729,"continuously":2730,"request_id":2731,"has_unfinished_requests":2732,"add_request":2733,"request_outputs":2734,"request_output":2735,"initialize_engine":2736,"from_engine_args":2737,"runs":2738,"datetime":2739,"union":2740,"albumentations":2741,"numpy":2742,"np":2743,"rasterio":2744,"regex":2745,"einops":2746,"rearrange":2747,"terratorch":2748,"datamodules":2749,"sen1floods11nongeodatamodule":2750,"set_default_dtype":2751,"float16":2752,"no_data":2753,"9999":2754,"no_data_float":2755,"0001":2756,"offset":2757,"percentile":2758,"datamodule_config":2759,"bands":2760,"blue":2761,"green":2762,"red":2763,"nir_narrow":2764,"swir_1":2765,"swir_2":2766,"batch_size":2767,"constant_scale":2768,"data_root":2769,"dccstor":2770,"geofm":2771,"finetuning":2772,"sen1floods11":2773,"drop_last":2774,"no_data_replace":2775,"no_label_replace":2776,"num_workers":2777,"test_transform":2778,"always_apply":2779,"interpolation":2780,"totensorv2":2781,"transpose_mask":2782,"prithvimae":2783,"skip_tokenizer_init":2784,"input_data":2785,"location_coords":2786,"structure":2787,"float32":2788,"pixel_values":2789,"use_tqdm":2790,"generate_datamodule":2791,"datamodule":2792,"process_channel_group":2793,"orig_img":2794,"reference":2795,"rgb":2796,"num_channels":2797,"valid_mask":2798,"ones_like":2799,"rescale":2800,"enhancing":2801,"contrast":2802,"max_value":2803,"3000":2804,"min_value":2805,"clamp":2806,"zeros":2807,"read_geotiff":2808,"file_path":2809,"ndarray":2810,"coords":2811,"lnglat":2812,"save_geotiff":2813,"output_path":2814,"band":2815,"geotiff":2816,"dest":2817,"_convert_np_uint8":2818,"float_image":2819,"255":2820,"astype":2821,"uint8":2822,"load_example":2823,"file_paths":2824,"std":2825,"paths":2826,"containing":2827,"array":2828,"imgs":2829,"metas":2830,"temporal_coords":2831,"rescaling":2832,"don":2833,"normalize":2834,"nodata":2835,"moveaxis":2836,"julian_day":2837,"strptime":2838,"timetuple":2839,"tm_yday":2840,"timestamp":2841,"axis":2842,"num_frames":2843,"expand_dims":2844,"di":2845,"run_model":2846,"img_size":2847,"lightning_model":2848,"reflect":2849,"pad":2850,"original_h":2851,"original_w":2852,"pad_h":2853,"pad_w":2854,"sliding":2855,"window":2856,"windows":2857,"unfold":2858,"h1":2859,"w1":2860,"batches":2861,"num_batches":2862,"tensor_split":2863,"dim":2864,"unsqueeze":2865,"prithvi":2866,"eo":2867,"300m":2868,"tl":2869,"pred_imgs":2870,"standardization":2871,"squeeze":2872,"transpose":2873,"no_grad":2874,"pred":2875,"y_hat":2876,"argmax":2877,"nn":2878,"interpolate":2879,"nearest":2880,"concat":2881,"patches":2882,"padded":2883,"area":2884,"data_file":2885,"output_dir":2886,"rgb_outputs":2887,"input_indices":2888,"model_obj":2889,"meta_data":2890,"10000":2891,"convert":2892,"bgr":2893,"compress":2894,"lzw":2895,"pred_file":2896,"pred_":2897,"tiff":2898,"rgb_orig":2899,"nan":2900,"img_pred":2901,"isnan":2902,"img_pred_file":2903,"rgb_pred_":2904,"name_suffix":2905,"rgb_file":2906,"original_rgb_":2907,"mae":2908,"add_help":2909,"india_900498_s2hand":2910,"tif":2911,"christian":2912,"pinto":2913,"nargs":2914,"six":2915,"selected":2916,"selects":2917,"s2l1c":2918,"vars":2919,"instantiating":2920,"logits":2921,"basic":2922,"implementing":2923,"dummylogitsprocessor":2924,"test_utils":2925,"dummy":2926,"employed":2927,"target_token":2928,"extra_args":2929,"mask":2930,"constructed":2931,"specifying":2932,"expect":2933,"decoded":2934,"yielding":2935,"shown":2936,"racist":2937,"he":2938,"nhe":2939,"hands":2940,"nthe":2941,"vllmconfig":2942,"logits_processor":2943,"batchupdate":2944,"logitsprocessor":2945,"movedirectionality":2946,"hypothetical":2947,"fake":2948,"logit":2949,"vllm_config":2950,"is_pin_memory":2951,"req_info":2952,"is_argmax_invariant":2953,"never":2954,"impacts":2955,"greedy":2956,"update_state":2957,"batch_update":2958,"moved":2959,"unidirectional":2960,"move":2961,"swap":2962,"adx":2963,"bdx":2964,"direct":2965,"a_val":2966,"b_val":2967,"modification":2968,"rows_list":2969,"cols":2970,"rows":2971,"values_to_keep":2972,"clone":2973,"inf":2974,"utilize":2975,"logitproc":2976,"sampling_params_list":2977,"67":2978,"logits_processors":2979,"60":2980,"credentials":2981,"llama2":2982,"lora_path":2983,"define":2984,"adapters":2985,"max_loras":2986,"expectation":2987,"adapter":2988,"ran":2989,"sql":2990,"query":2991,"table":2992,"schema":2993,"table_name_74":2994,"icao":2995,"varchar":2996,"airport":2997,"lilongwe":2998,"international":2999,"32003":3000,"lora2":3001,"controls":3002,"loras":3003,"numbers":3004,"higher":3005,"slot":3006,"preallocated":3007,"know":3008,"low":3009,"possible":3010,"max_cpu_loras":3011,"repo_id":3012,"yard1":3013,"guided":3014,"structured":3015,"techniques":3016,"grammar":3017,"formatted":3018,"pydantic":3019,"basemodel":3020,"guideddecodingparams":3021,"options":3022,"guided_decoding_params_choice":3023,"negative":3024,"sampling_params_choice":3025,"guided_decoding":3026,"prompt_choice":3027,"classify":3028,"sentiment":3029,"wonderful":3030,"guided_decoding_params_regex":3031,"sampling_params_regex":3032,"prompt_regex":3033,"alan":3034,"turing":3035,"works":3036,"enigma":3037,"cartype":3038,"sedan":3039,"suv":3040,"truck":3041,"coupe":3042,"cardescription":3043,"brand":3044,"car_type":3045,"json_schema":3046,"model_json_schema":3047,"guided_decoding_params_json":3048,"sampling_params_json":3049,"prompt_json":3050,"iconic":3051,"car":3052,"simplified_sql_grammar":3053,"select_statement":3054,"column":3055,"condition":3056,"col_1":3057,"col_2":3058,"table_1":3059,"table_2":3060,"guided_decoding_params_grammar":3061,"sampling_params_grammar":3062,"prompt_grammar":3063,"username":3064,"format_output":3065,"generate_output":3066,"choice_output":3067,"regex_output":3068,"json_output":3069,"grammar_output":3070,"am":3071,"config_buckets":3072,"initialize_llm":3073,"openlm":3074,"open_llama_7b":3075,"open_llama_3b":3076,"32":3077,"neuronx_distributed_inference":3078,"add_instruct":3079,"textprompt":3080,"get_image":3081,"recipe":3082,"mayonnaise":3083,"sentences":3084,"italy":3085,"famous":3086,"pexels":3087,"photos":3088,"1108099":3089,"photo":3090,"jpeg":3091,"auto":3092,"tinysrgb":3093,"dpr":3094,"500":3095,"get_vllm_mllama_model_inputs":3096,"single_image":3097,"put":3098,"compose":3099,"input_image":3100,"has_image":3101,"numel":3102,"instruct_prompt":3103,"print_outputs":3104,"got":3105,